RobertoBenjami/stm32_vga/Drivers/stm32_adafruit_lcd_fb.c
/*
 * Modify: Roberto Benjami
 * date: 2020.02
 *
 * - Modify to framebuffer mode
 *
 * - BSP_LCD_DrawCircle : delete the BSP_LCD_SetFont(&LCD_DEFAULT_FONT); (interesting bug)
 * - BSP_LCD_Init : DrawProp.pFont = &Font24 change to DrawProp.pFont = &LCD_DEFAULT_FONT
 * - FillTriangle -> BSP_LCD_FillTriangle, change to public, changed to fast algorythm
 * - Add : BSP_LCD_ReadID
 * - Add : BSP_LCD_ReadPixel
 * - Add : BSP_LCD_DrawRGB16Image
 * - Add : BSP_LCD_ReadRGB16Image
 * - Add : BSP_LCD_FillTriangle (faster algorithm)
 * - Modify : BSP_LCD_Init (default font from header file, default colors from header file, otptional clear from header file)
 * */

/**
  ******************************************************************************
  * @file    stm32_adafruit_lcd.c
  * @author  MCD Application Team
  * @brief   This file includes the driver for Liquid Crystal Display (LCD) module
  *          mounted on the Adafruit 1.8" TFT LCD shield (reference ID 802), 
  *          that is used with the STM32 Nucleo board through SPI interface.     
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2016 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */ 

/* Dependencies
- fonts.h
- font24.c
- font20.c
- font16.c
- font12.c
- font8.c"
EndDependencies */
    
/* Includes ------------------------------------------------------------------*/
#include <stdlib.h>
#include "main.h"
#include "lcd.h"
#include "bmp.h"
#include "stm32_adafruit_lcd_fb.h"
#include "Fonts/fonts.h"

/* @defgroup STM32_ADAFRUIT_LCD_Private_Defines */
#define POLY_X(Z)             ((int32_t)((Points + (Z))->X))
#define POLY_Y(Z)             ((int32_t)((Points + (Z))->Y))

/* @defgroup STM32_ADAFRUIT_LCD_Private_Macros */
#define ABS(X) ((X) > 0 ? (X) : -(X))
#define SWAP16(a, b) {uint16_t t = a; a = b; b = t;}

/* @defgroup STM32_ADAFRUIT_LCD_Private_Variables */ 
LCD_DrawPropTypeDef DrawProp;

/* @defgroup STM32_ADAFRUIT_LCD_Private_FunctionPrototypes */ 
static void DrawChar(uint16_t Xpos, uint16_t Ypos, const uint8_t *c);
// static void SetDisplayWindow(uint16_t Xpos, uint16_t Ypos, uint16_t Width, uint16_t Height);

enum
{
  RIGHT_THEN_DOWN = 0,
  RIGHT_THEN_UP
} BitmapDrawDir = RIGHT_THEN_DOWN;

#if   LCD_COLORBITDEPTH == 8
const uint32_t DefaultPalette[]=
{ 0x000000, 0x000055, 0x0000AA, 0x0000FF, 0x002400, 0x002455, 0x0024AA, 0x0024FF,
  0x004800, 0x004855, 0x0048AA, 0x0048FF, 0x006D00, 0x006D55, 0x006DAA, 0x006DFF,
  0x009100, 0x009155, 0x0091AA, 0x0091FF, 0x00B600, 0x00B655, 0x00B6AA, 0x00B6FF,
  0x00DA00, 0x00DA55, 0x00DAAA, 0x00DAFF, 0x00FF00, 0x00FF55, 0x00FFAA, 0x00FFFF,
  0x240000, 0x240055, 0x2400AA, 0x2400FF, 0x242400, 0x242455, 0x2424AA, 0x2424FF,
  0x244800, 0x244855, 0x2448AA, 0x2448FF, 0x246D00, 0x246D55, 0x246DAA, 0x246DFF,
  0x249100, 0x249155, 0x2491AA, 0x2491FF, 0x24B600, 0x24B655, 0x24B6AA, 0x24B6FF,
  0x24DA00, 0x24DA55, 0x24DAAA, 0x24DAFF, 0x24FF00, 0x24FF55, 0x24FFAA, 0x24FFFF,
  0x480000, 0x480055, 0x4800AA, 0x4800FF, 0x482400, 0x482455, 0x4824AA, 0x4824FF,
  0x484800, 0x484855, 0x4848AA, 0x4848FF, 0x486D00, 0x486D55, 0x486DAA, 0x486DFF,
  0x489100, 0x489155, 0x4891AA, 0x4891FF, 0x48B600, 0x48B655, 0x48B6AA, 0x48B6FF,
  0x48DA00, 0x48DA55, 0x48DAAA, 0x48DAFF, 0x48FF00, 0x48FF55, 0x48FFAA, 0x48FFFF,
  0x6D0000, 0x6D0055, 0x6D00AA, 0x6D00FF, 0x6D2400, 0x6D2455, 0x6D24AA, 0x6D24FF,
  0x6D4800, 0x6D4855, 0x6D48AA, 0x6D48FF, 0x6D6D00, 0x6D6D55, 0x6D6DAA, 0x6D6DFF,
  0x6D9100, 0x6D9155, 0x6D91AA, 0x6D91FF, 0x6DB600, 0x6DB655, 0x6DB6AA, 0x6DB6FF,
  0x6DDA00, 0x6DDA55, 0x6DDAAA, 0x6DDAFF, 0x6DFF00, 0x6DFF55, 0x6DFFAA, 0x6DFFFF,
  0x910000, 0x910055, 0x9100AA, 0x9100FF, 0x912400, 0x912455, 0x9124AA, 0x9124FF,
  0x914800, 0x914855, 0x9148AA, 0x9148FF, 0x916D00, 0x916D55, 0x916DAA, 0x916DFF,
  0x919100, 0x919155, 0x9191AA, 0x9191FF, 0x91B600, 0x91B655, 0x91B6AA, 0x91B6FF,
  0x91DA00, 0x91DA55, 0x91DAAA, 0x91DAFF, 0x91FF00, 0x91FF55, 0x91FFAA, 0x91FFFF,
  0xB60000, 0xB60055, 0xB600AA, 0xB600FF, 0xB62400, 0xB62455, 0xB624AA, 0xB624FF,
  0xB64800, 0xB64855, 0xB648AA, 0xB648FF, 0xB66D00, 0xB66D55, 0xB66DAA, 0xB66DFF,
  0xB69100, 0xB69155, 0xB691AA, 0xB691FF, 0xB6B600, 0xB6B655, 0xB6B6AA, 0xB6B6FF,
  0xB6DA00, 0xB6DA55, 0xB6DAAA, 0xB6DAFF, 0xB6FF00, 0xB6FF55, 0xB6FFAA, 0xB6FFFF,
  0xDA0000, 0xDA0055, 0xDA00AA, 0xDA00FF, 0xDA2400, 0xDA2455, 0xDA24AA, 0xDA24FF,
  0xDA4800, 0xDA4855, 0xDA48AA, 0xDA48FF, 0xDA6D00, 0xDA6D55, 0xDA6DAA, 0xDA6DFF,
  0xDA9100, 0xDA9155, 0xDA91AA, 0xDA91FF, 0xDAB600, 0xDAB655, 0xDAB6AA, 0xDAB6FF,
  0xDADA00, 0xDADA55, 0xDADAAA, 0xDADAFF, 0xDAFF00, 0xDAFF55, 0xDAFFAA, 0xDAFFFF,
  0xFF0000, 0xFF0055, 0xFF00AA, 0xFF00FF, 0xFF2400, 0xFF2455, 0xFF24AA, 0xFF24FF,
  0xFF4800, 0xFF4855, 0xFF48AA, 0xFF48FF, 0xFF6D00, 0xFF6D55, 0xFF6DAA, 0xFF6DFF,
  0xFF9100, 0xFF9155, 0xFF91AA, 0xFF91FF, 0xFFB600, 0xFFB655, 0xFFB6AA, 0xFFB6FF,
  0xFFDA00, 0xFFDA55, 0xFFDAAA, 0xFFDAFF, 0xFFFF00, 0xFFFF55, 0xFFFFAA, 0xFFFFFF};
#endif

